demo-output/website/dafoam/ladder-b/duct_baseline/AR_3_Ret_360/0/k_LES
k_LES nonuniform List<scalar>
8748
(
22.333188442859555
24.613956684452216
28.296826490240395
32.64381047388045
37.171263975786424
41.538979542008725
45.71388596020141
49.69971399474296
...
);
