demo-output/website/dafoam/ladder-b/duct_baseline/AR_3_Ret_360/constant/Cx
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "constant";
    object      Cx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
8748
(
0.0005
0.0005
0.0005
0.0005
0.0005
0.0005
0.0005
0.0005
...
)
;

boundaryField
{
    inflow
    {
        type            cyclic;
    }
    outflow
    {
        type            cyclic;
    }
    wallTop
    {
        type            calculated;
        value           nonuniform List<scalar> 
162
(
0.0005
0.0005
0.0005
0.0005
0.0005
0.0005
0.0005
0.0005
...
)
;
    }
    wallSide
    {
        type            calculated;
        value           nonuniform List<scalar> 
54
(
0.0005
0.0005
0.0005
0.0005
0.0005
0.0005
0.0005
0.0005
...
)
;
    }
    symmetryBottom
    {
        type            symmetry;
    }
    symmetrySide
    {
        type            symmetry;
    }
}


// ************************************************************************* //
