demo-output/website/dafoam/ladder-b/duct_baseline/AR_3_Ret_360/constant/Cy
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "constant";
    object      Cy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
8748
(
4.572056072e-05
0.0001330052675
0.000212355001
0.0002844911224
0.0003500694144
0.0004096860436
0.0004638829793
0.0005131529208
...
)
;

boundaryField
{
    inflow
    {
        type            cyclic;
    }
    outflow
    {
        type            cyclic;
    }
    wallTop
    {
        type            calculated;
        value           nonuniform List<scalar> 
162
(
0.001
0.001
0.001
0.001
0.001
0.001
0.001
0.001
...
)
;
    }
    wallSide
    {
        type            calculated;
        value           nonuniform List<scalar> 
54
(
4.572056072e-05
0.0001330052675
0.000212355001
0.0002844911224
0.0003500694144
0.0004096860436
0.0004638829793
0.0005131529208
...
)
;
    }
    symmetryBottom
    {
        type            symmetry;
    }
    symmetrySide
    {
        type            symmetry;
    }
}


// ************************************************************************* //
